Public Member Functions | Static Public Member Functions | List of all members
ACAPI::MEP::v1::RigidSegment Class Referencefinal
MEP Element Manager
The RigidSegment is placed in RoutingSegments. More...
#include <MEPRigidSegment.hpp>
 Inheritance diagram for ACAPI::MEP::v1::RigidSegment:
 Public Member Functions
~RigidSegment ()
std::optional< double >  | GetInsulationThickness () const
double  | GetLength () const
double  | GetWidth () const
double  | GetHeight () const
UniqueID  | GetRoutingSegmentId () const
Domain  | GetDomain () const
RigidSegmentDefault  | PickUpDefault () const
Picks up and returns the Default of the RigidSegment.
 Public Member Functions inherited from ACAPI::MEP::v1::ElementBase
bool  | Exists () const
std::vector< UniqueID >  | GetPortIDs () const
std::vector< UniqueID >  | GetDirectConnectedMEPElementIds () const
API_Coord3D  | GetAnchorPoint () const
Orientation  | GetOrientation () const
API_Guid  | GetObjectId () const
 Static Public Member Functions
static Result< RigidSegment >  | Get (const UniqueID &uniqueId)
Returns a RigidSegment.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::v1::ElementBase
ElementBase (std::shared_ptr< Impl::IElementBaseImpl >)
~ElementBase ()
Detailed Description
The RigidSegment is placed in RoutingSegments.
This type of element is placed automatically, it is used to fill a RoutingSegment.
Since
Archicad 27
Example code snippet from Test/New MEP
Getters
 ACAPI::Result<RigidSegment> rigidSegment = RigidSegment::Get (id);
 if (rigidSegment.IsErr ()) {
 ACAPI_WriteReport (rigidSegment.UnwrapErr ().text.c_str (), false);
 return;
 }
 Reporter rigidSegmentReporter (3);
 rigidSegmentReporter.Add ("RigidSegment id", id);
 rigidSegmentReporter.SetTabCount (4);
 rigidSegmentReporter.Add ("Length", rigidSegment->GetLength ());
 rigidSegmentReporter.Add ("Width", rigidSegment->GetWidth ());
 rigidSegmentReporter.Add ("Height", rigidSegment->GetHeight ());
 rigidSegmentReporter.Write ();
Constructor & Destructor Documentation
◆ ~RigidSegment()
 ACAPI::MEP::v1::RigidSegment::~RigidSegment  |  ( |   | )
Member Function Documentation
◆ Get()
 static Result< RigidSegment > ACAPI::MEP::v1::RigidSegment::Get  |  ( |  const UniqueID &  |  uniqueId | )
static
Returns a RigidSegment.
Parameters
uniqueId | The UniqueID of the requested RigidSegment.
Returns
If the uniqueId belongs to a RigidSegment, returns the object associated to it, otherwise Error.
◆ GetDomain()
 Domain ACAPI::MEP::v1::RigidSegment::GetDomain  |  ( |   | ) |   const
Returns
Returns the domain of the RigidSegment.
◆ GetHeight()
 double ACAPI::MEP::v1::RigidSegment::GetHeight  |  ( |   | ) |   const
Returns
Returns the height of the RigidSegment.
◆ GetInsulationThickness()
 std::optional< double > ACAPI::MEP::v1::RigidSegment::GetInsulationThickness  |  ( |   | ) |   const
Returns
Returns the insulation thickness if the RigidSegment has insulation, otherwise std::nullopt. RigidSegment of cable carrier domain cannot have insulation.
◆ GetLength()
 double ACAPI::MEP::v1::RigidSegment::GetLength  |  ( |   | ) |   const
Returns
Returns the length of the RigidSegment.
◆ GetRoutingSegmentId()
 UniqueID ACAPI::MEP::v1::RigidSegment::GetRoutingSegmentId  |  ( |   | ) |   const
Returns
Returns the UniqueID of the RoutingSegment that it belongs to.
◆ GetWidth()
 double ACAPI::MEP::v1::RigidSegment::GetWidth  |  ( |   | ) |   const
Returns
Returns the width of the RigidSegment.
◆ PickUpDefault()
 RigidSegmentDefault ACAPI::MEP::v1::RigidSegment::PickUpDefault  |  ( |   | ) |   const
Picks up and returns the Default of the RigidSegment.
Returns
Returns a RigidSegmentDefault with the parameters of the object it was called for.